[
  {
    "id": "dgn836wTmz",
    "title": "Rape.",
    "description": "A man is said to commit “rape” if he—\n(a) penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or\n(b) inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person; or\n(c) manipulates any part of the body of a woman so as to cause penetration into the vagina, urethra, anus or any part of body of such woman or makes her to do so with him or any other person; or\n(d) applies his mouth to the vagina, anus, urethra of a woman or makes her to do so with him or any other person, under the circumstances falling under any of the following seven descriptions:—\n(i) against her will;\n(ii) without her consent;\n(iii) with her consent, when her consent has been obtained by putting her or any person in whom she is interested, in fear of death or of hurt;\n(iv) with her consent, when the man knows that he is not her husband and that her consent is given because she believes that he is another man to whom she is or believes herself to be lawfully married;\n(v) with her consent when, at the time of giving such consent, by reason of unsoundness of mind or intoxication or the administration by him personally or through another of any stupefying or unwholesome substance, she is unable to understand the nature and consequences of that to which she gives consent;\n(vi) with or without her consent, when she is under eighteen years of age;\n(vii) when she is unable to communicate consent.\nExplanation 1.—For the purposes of this section, “vagina” shall also include labia majora.\nExplanation 2.—Consent means an unequivocal voluntary agreement when the woman by words, gestures or any form of verbal or non-verbal communication, communicates willingness to participate in the specific sexual act:\nProvided that a woman who does not physically resist to the act of penetration shall not by the reason only of that fact, be regarded as consenting to the sexual activity.\nException 1.—A medical procedure or intervention shall not constitute rape.\nException 2.—Sexual intercourse or sexual acts by a man with his own wife, the wife not being under eighteen years of age, is not rape."
  },
  {
    "id": "a7AnUX3qbi",
    "title": "Punishment for rape.",
    "description": "(1) Whoever, except in the cases provided for in sub-section (2), commits rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine.\n(2) Whoever,—\n(a) being a police officer, commits rape,—\n(i) within the limits of the police station to which such police officer is appointed; or\n(ii) in the premises of any station house; or\n(iii) on a woman in such police officer’s custody or in the custody of a police officer subordinate to such police officer; or\n(b) being a public servant, commits rape on a woman in such public servant’s custody or in the custody of a public servant subordinate to such public servant; or\n(c) being a member of the armed forces deployed in an area by the Central Government or a State Government commits rape in such area; or\n(d) being on the management or on the staff of a jail, remand home or other place of custody established by or under any law for the time being in force or of a women’s or children’s institution, commits rape on any inmate of such jail, remand home, place or institution; or\n(e) being on the management or on the staff of a hospital, commits rape on a woman in that hospital; or\n(f) being a relative, guardian or teacher of, or a person in a position of trust or authority towards the woman, commits rape on such woman; or\n(g) commits rape during communal or sectarian violence; or\n(h) commits rape on a woman knowing her to be pregnant; or\n(i) commits rape, on a woman incapable of giving consent; or\n(j) being in a position of control or dominance over a woman, commits rape on such woman; or\n(k) commits rape on a woman suffering from mental or physical disability; or\n(l) while committing rape causes grievous bodily harm or maims or disfigures or endangers the life of a woman; or\n(m) commits rape repeatedly on the same woman, shall be punished with rigorous imprisonment for a term which shall not be less than ten years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and shall also be liable to fine.\nExplanation.—For the purposes of this sub-section,—\n(a) “armed forces” means the naval, army and air forces and includes any member of the Armed Forces constituted under any law for the time being in force, including the paramilitary forces and any auxiliary forces that are under the control of the Central Government or the State Government;\n(b) “hospital” means the precincts of the hospital and includes the precincts of any institution for the reception and treatment of persons during convalescence or of persons requiring medical attention or rehabilitation;\n(c) “police officer” shall have the same meaning as assigned to the expression “police” under the Police Act, 1861 (5 of 1861);\n(d) “women’s or children’s institution” means an institution, whether called an orphanage or a home for neglected women or children or a widow’s home or an institution called by any other name, which is established and maintained for the reception and care of women or children."
  },
  {
    "id": "rz0FUzI7mj",
    "title": "Punishment for rape in certain cases.",
    "description": "(1) Whoever, commits rape on a woman under sixteen years of age shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and shall also be liable to fine:\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim:\nProvided further that any fine imposed under this sub-section shall be paid to the victim.\n(2) Whoever, commits rape on a woman under twelve years of age shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and with fine or with death:\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim:\nProvided further that any fine imposed under this sub-section shall be paid to the victim.\n"
  },
  {
    "id": "dCBubhN9c6",
    "title": "Punishment for causing death or resulting in persistent vegetative state of victim.",
    "description": "Whoever, commits an offence punishable under sub-section (1) or sub-section (2) of section 64 and in the course of such commission inflicts an injury which causes the death of the woman or causes the woman to be in a persistent vegetative state, shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, or with death."
  },
  {
    "id": "DaH7ixJ0pq",
    "title": "Sexual intercourse by husband upon his wife during separation.",
    "description": "Whoever has sexual intercourse with his own wife, who is living separately, whether under a decree of separation or otherwise, without her consent, shall be punished with imprisonment of either description for a term which shall not be less than two years but which may extend to seven years, and shall also be liable to fine.\nExplanation.—In this section, “sexual intercourse” shall mean any of the acts mentioned in clauses (a) to (d) of section 63."
  },
  {
    "id": "YEbRW333q4",
    "title": "Sexual intercourse by a person in authority.",
    "description": "Whoever, being—.\n(a) in a position of authority or in a fiduciary relationship; or.\n(b) a public servant; or.\n(c) superintendent or manager of a jail, remand home or other place of custody established by or under any law for the time being in force, or a women’s or children’s institution; or.\n(d) on the management of a hospital or being on the staff of a hospital, abuses such position or fiduciary relationship to induce or seduce any woman either in his custody or under his charge or present in the premises to have sexual intercourse with him, such sexual intercourse not amounting to the offence of rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than five years, but which may extend to ten years, and shall also be liable to fine..\nExplanation 1.— In this section, “sexual intercourse” shall mean any of the acts mentioned in clauses (a) to (d) of section 63..\nExplanation 2.— For the purposes of this section, Explanation 1 to section 63 shall also be applicable..\nExplanation 3.— “Superintendent”, in relation to a jail, remand home or other place of custody or a women’s or children’s institution, includes a person holding any other office in such jail, remand home, place or institution by virtue of which such person can exercise any authority or control over its inmates..\nExplanation 4.—The expressions “hospital” and “women’s or children’s institution” shall respectively have the same meanings as in clauses (b) and (d) of the Explanation to sub-section (2) of section 64."
  },
  {
    "id": "HDNuOtHAYZ",
    "title": "Sexual intercourse by employing deceitful means, etc.",
    "description": "Whoever, by deceitful means or by making promise to marry to a woman without any intention of fulfilling the same, has sexual intercourse with her, such sexual intercourse not amounting to the offence of rape, shall be punished with imprisonment of either description for a term which may extend to ten years and shall also be liable to fine.\nExplanation.— “deceitful means” shall include inducement for, or false promise of employment or promotion, or marrying by suppressing identity.\n"
  },
  {
    "id": "Qk9a7PFuxp",
    "title": "Gang rape.",
    "description": "(1) Where a woman is raped by one or more persons constituting a group or acting in furtherance of a common intention, each of those persons shall be deemed to have committed the offence of rape and shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life which shall mean imprisonment for the remainder of that person’s natural life, and with fine:\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim:\nProvided further that any fine imposed under this sub-section shall be paid to the victim.\n(2) Where a woman under eighteen years of age is raped by one or more persons constituting a group or acting in furtherance of a common intention, each of those persons shall be deemed to have committed the offence of rape and shall be punished with imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and with fine, or with death:\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim:\nProvided further that any fine imposed under this sub-section shall be paid to the victim."
  },
  {
    "id": "97XoI6WZnZ",
    "title": "Punishment for repeat offenders.",
    "description": "Whoever has been previously convicted of an offence punishable under section 64 or section 65 or section 66 or section 70 and is subsequently convicted of an offence punishable under any of the said sections shall be punished with imprisonment for life which shall mean imprisonment for the remainder of that person’s natural life, or with death."
  },
  {
    "id": "RAQkjuF7jp",
    "title": "Disclosure of identity of victim of certain offences, etc.",
    "description": "(1) Whoever prints or publishes the name or any matter which may make known the identity of any person against whom an offence under section 64 or section 65 or section 66 or section 67 or section 68 or section 69 or section 70 or section 71 is alleged or found to have been committed (hereafter in this section referred to as the victim) shall be punished with imprisonment of either description for a term which may extend to two years and shall also be liable to fine.\n(2) Nothing in sub-section (1) extends to any printing or publication of the name or any matter which may make known the identity of the victim if such printing or publication is—\n(a) by or under the order in writing of the officer-in-charge of the police station or the police officer making the investigation into such offence acting in good faith for the purposes of such investigation; or\n"
  },
  {
    "id": "NowzQEN7nE",
    "title": "Printing or publishing any matter relating to Court proceedings without permission.",
    "description": "Whoever prints or publishes any matter in relation to any proceeding before a Court with respect to an offence referred to in section 72 without the previous permission of such Court shall be punished with imprisonment of either description for a term which may extend to two years and shall also be liable to fine.\nExplanation.The printing or publication of the judgment of any High Court or the Supreme Court does not amount to an offence within the meaning of this section.\n"
  },
  {
    "id": "QOjQTycmwX",
    "title": "Assault or use of criminal force to woman with intent to outrage her modesty.",
    "description": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which shall not be less than one year but which may extend to five years, and shall also be liable to fine."
  },
  {
    "id": "K0xdvO4f9G",
    "title": "Sexual harassment.",
    "description": "(1) A man committing any of the following acts:\n(i) physical contact and advances involving unwelcome and explicit sexual overtures; or\nspan@(ii) a demand or request for sexual favours; or\n(iii) showing pornography against the will of a woman; or\n(iv) making sexually coloured remarks,\nshall be guilty of the offence of sexual harassment.\n(2) Any man who commits the offence specified in clause (i) or clause (ii) or clause (iii) of sub-section (1) shall be punished with rigorous imprisonment for a term which may extend to three years, or with fine, or with both.\n(3) Any man who commits the offence specified in clause (iv) of sub-section (1) shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },
  {
    "id": "Vns9hD2c7W",
    "title": "Assault or use of criminal force to woman with intent to disrobe.",
    "description": "Whoever assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment of either description for a term which shall not be less than three years but which may extend to seven years, and shall also be liable to fine.\n"
  },
  {
    "id": "PNRKQou2pa",
    "title": "Voyeurism.",
    "description": "Whoever watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed either by the perpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be punished on first conviction with imprisonment of either description for a term which shall not be less than one year, but which may extend to three years, and shall also be liable to fine, and be punished on a second or subsequent conviction, with imprisonment of either description for a term which shall not be less than three years, but which may extend to seven years, and shall also be liable to fine.\nExplanation 1.—For the purposes of this section, “private act” includes an act of watching carried out in a place which, in the circumstances, would reasonably be expected to provide privacy and where the victim’s genitals, posterior or breasts are exposed or covered only in underwear; or the victim is using a lavatory; or the victim is doing a sexual act that is not of a kind ordinarily done in public.\nExplanation 2.—Where the victim consents to the capture of the images or any act, but not to their dissemination to third persons and where such image or act is disseminated, such dissemination shall be considered an offence under this section."
  },
  {
    "id": "LxBRW2HMRb",
    "title": "Stalking.",
    "description": "(1) Any man who—\n(i) follows a woman and contacts, or attempts to contact such woman to foster personal interaction repeatedly despite a clear indication of disinterest by such woman; or\n(ii) monitors the use by a woman of the internet, e-mail or any other form of electronic communication, commits the offence of stalking:\nProvided that such conduct shall not amount to stalking if the man who pursued it proves that—\n(i) it was pursued for the purpose of preventing or detecting crime and the man accused of stalking had been entrusted with the responsibility of prevention and detection of crime by the State; or\n(ii) it was pursued under any law or to comply with any condition or requirement imposed by any person under any law; or\n(iii) in the particular circumstances such conduct was reasonable and justified.\n(2) Whoever commits the offence of stalking shall be punished on first conviction with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine; and be punished on a second or subsequent conviction, with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine."
  },
  {
    "id": "cPYkapI594",
    "title": "Word, gesture or act intended to insult modesty of a woman.",
    "description": "Whoever, intending to insult the modesty of any woman, utters any words, makes any sound or gesture, or exhibits any object in any form, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine."
  },
  {
    "id": "21dWENIPWl",
    "title": "Dowry death.",
    "description": "(1) Where the death of a woman is caused by any burns or bodily injury or occurs otherwise than under normal circumstances within seven years of her marriage and it is shown that soon before her death she was subjected to cruelty or harassment by her husband or any relative of her husband for, or in connection with, any demand for dowry, such death shall be called “dowry death”, and such husband or relative shall be deemed to have caused her death.\nExplanation.—For the purposes of this sub-section, “dowry” shall have the same meaning as in section 2 of the Dowry Prohibition Act, 1961 (28 of 1961).\n(2) Whoever commits dowry death shall be punished with imprisonment for a term which shall not be less than seven years but which may extend to imprisonment for life."
  },
  {
    "id": "kGmPmiDgpw",
    "title": "Cohabitation caused by man deceitfully inducing belief of lawful marriage.",
    "description": "Every man who by deceit causes any woman who is not lawfully married to him to believe that she is lawfully married to him and to cohabit or have sexual intercourse with him in that belief, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "id": "Eq8vyQ9rnD",
    "title": "Marrying again during lifetime of husband or wife.",
    "description": "(1) Whoever, having a husband or wife living, marries in any case in which such marriage is void by reason of its taking place during the life of such husband or wife, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\n(Exception.—This sub-section does not extend to any person whose marriage with such husband or wife has been declared void by a Court of competent jurisdiction, nor to any person who contracts a marriage during the life of a former husband or wife, if such husband or wife, at the time of the subsequent marriage, shall have been continually absent from such person for the space of seven years, and shall not have been heard of by such person as being alive within that time provided the person contracting such subsequent marriage shall, before such marriage takes place, inform the person with whom such marriage is contracted of the real state of facts so far as the same are within his or her knowledge.\n((2) Whoever commits the offence under sub-section (1) having concealed from the person with whom the subsequent marriage is contracted, the fact of the former marriage, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "id": "3X5VPRSvMi",
    "title": "Marriage ceremony fraudulently gone through without lawful marriage.",
    "description": "Whoever, dishonestly or with a fraudulent intention, goes through the ceremony of being married, knowing that he is not thereby lawfully married, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "id": "QJriC1XHYD",
    "title": "Enticing or taking away or detaining with criminal intent a married woman.",
    "description": "Whoever takes or entices away any woman who is and whom he knows or has reason to believe to be the wife of any other man, with intent that she may have illicit intercourse with any person, or conceals or detains with that intent any such woman, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "id": "TTTQW1nbPD",
    "title": "Husband or relative of husband of a woman subjecting her to cruelty.",
    "description": "Whoever, being the husband or the relative of the husband of a women, subjects such women to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine"
  },
  {
    "id": "TkLmIeGB5i",
    "title": "Cruelty defined.",
    "description": "For the purposes of section 85, “cruelty” means—.\n(a) any wilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or.\n(b) harassment of the woman where such harassment is with a view to coercing her or any person related to her to meet any unlawful demand for any property or valuable security or is on account of failure by her or any person related to her to meet such demand.\n"
  },
  {
    "id": "LQSicXewrh",
    "title": "Kidnapping, abducting or inducing woman to compel her marriage, etc.",
    "description": "Whoever kidnaps or abducts any woman with intent that she may be compelled, or knowing it to be likely that she will be compelled, to marry any person against her will, or in order that she may be forced or seduced to illicit intercourse, or knowing it to be likely that she will be forced or seduced to illicit intercourse, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and whoever, by means of criminal intimidation as defined in this Sanhita or of abuse of authority or any other method of compulsion, induces any woman to go from any place with intent that she may be, or knowing that it is likely that she will be, forced or seduced to illicit intercourse with another person shall also be punishable as aforesaid."
  },
  {
    "id": "JDuEDvenQX",
    "title": "Causing miscarriage.",
    "description": "Whoever voluntarily causes a woman with child to miscarry, shall, if such miscarriage be not caused in good faith for the purpose of saving the life of the woman, be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both; and, if the woman be quick with child, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\nExplanation.—A woman who causes herself to miscarry, is within the meaning of this section."
  },
  {
    "id": "mQCsakvAeQ",
    "title": "Causing miscarriage without woman's consent.",
    "description": "Whoever commits the offence under section 88 without the consent of the woman, whether the woman is quick with child or not, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "id": "eZVd6YiMim",
    "title": "Death caused by act done with intent to cause miscarriage.",
    "description": "(1) Whoever, with intent to cause the miscarriage of a woman with child, does any act which causes the death of such woman, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.\n(2) Where the act referred to in sub-section (1) is done without the consent of the woman, shall be punishable either with imprisonment for life, or with the punishment specified in said sub-section.\nExplanation.—It is not essential to this offence that the offender should know that the act is likely to cause death."
  },
  {
    "id": "c5USOtv9aR",
    "title": "Act done with intent to prevent child being born alive or to cause to die after birth.",
    "description": "Whoever before the birth of any child does any act with the intention of thereby preventing that child from being born alive or causing it to die after its birth, and does by such act prevent that child from being born alive, or causes it to die after its birth, shall, if such act be not caused in good faith for the purpose of saving the life of the mother, be punished with imprisonment of either description for a term which may extend to ten years, or with fine, or with both."
  },
  {
    "id": "iGO5m4Yhdc",
    "title": "Causing death of quick unborn child by act amounting to culpable homicide.",
    "description": "Whoever does any act under such circumstances, that if he thereby caused death he would be guilty of culpable homicide, and does by such act cause the death of a quick unborn child, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.\nIllustration.\nA, knowing that he is likely to cause the death of a pregnant woman, does an act which, if it caused the death of the woman, would amount to culpable homicide. The woman is injured, but does not die; but the death of an unborn quick child with which she is pregnant is thereby caused. A is guilty of the offence defined in this section."
  },
  {
    "id": "hTsDUC03JH",
    "title": "Exposure and abandonment of child under twelve years of age, by parent or person having care of it.",
    "description": "Whoever being the father or mother of a child under the age of twelve years, or having the care of such child, shall expose or leave such child in any place with the intention of wholly abandoning such child, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.\nExplanation.—This section is not intended to prevent the trial of the offender for murder or culpable homicide, as the case may be, if the child die in consequence of the exposure.\n"
  },
  {
    "id": "QUFdO2hW7X",
    "title": "Concealment of birth by secret disposal of dead body.",
    "description": "Whoever, by secretly burying or otherwise disposing of the dead body of a child whether such child die before or after or during its birth, intentionally conceals or endeavours to conceal the birth of such child, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n"
  },
  {
    "id": "Z6M4W1sJSR",
    "title": "Hiring, employing or engaging a child to commit an offence.",
    "description": "Whoever hires, employs or engages any child to commit an offence shall be punished with imprisonment of either description which shall not be less than three years but which may extend to ten years, and with fine; and if the offence be committed shall also be punished with the punishment provided for that offence as if the offence has been committed by such person himself.\nExplanation.—Hiring, employing, engaging or using a child for sexual exploitation or pornography is covered within the meaning of this section.\n"
  },
  {
    "id": "2DxVzyJITq",
    "title": "Procuration of child.",
    "description": "Whoever, by any means whatsoever, induces any child to go from any place or to do any act with intent that such child may be, or knowing that it is likely that such child will be, forced or seduced to illicit intercourse with another person shall be punishable with imprisonment which may extend to ten years, and shall also be liable to fine."
  },
  {
    "id": "Ef7A1S0aAy",
    "title": "Kidnapping or abducting child under ten years of age with intent to steal from its person.",
    "description": "Whoever kidnaps or abducts any child under the age of ten years with the intention of taking dishonestly any movable property from the person of such child, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "id": "4muElgVg1L",
    "title": "Selling child for purposes of prostitution, etc.",
    "description": "Whoever sells, lets to hire, or otherwise disposes of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, or knowing it to be likely that such child will at any age be employed or used for any such purpose, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine..\nExplanation 1.--When a female under the age of eighteen years is sold, let for hire, or otherwise disposed of to a prostitute or to any person who keeps or manages a brothel, the person so disposing of such female shall, until the contrary is proved, be presumed to have disposed of her with the intent that she shall be used for the purpose of prostitution..\nExplanation 2.--For the purposes of this section \"illicit intercourse\" means sexual intercourse between persons not united by marriage or by any union or tie which, though not amounting to a marriage, is recognised by the personal law or custom of the community to which they belong or, where they belong to different communities, of both such communities, as constituting between them a quasi-marital relation."
  },
  {
    "id": "seEXx5trYX",
    "title": "Buying child for purposes of prostitution, etc.",
    "description": "Whoever buys, hires or otherwise obtains possession of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, or knowing it to be likely that such child will at any age be employed or used for any such purpose, shall be punished with imprisonment of either description for a term which shall not be less than seven years but which may extend to fourteen years, and shall also be liable to fine.\nExplanation 1.—Any prostitute or any person keeping or managing a brothel, who buys, hires or otherwise obtains possession of a female under the age of eighteen years shall, until the contrary is proved, be presumed to have obtained possession of such female with the intent that she shall be used for the purpose of prostitution.\nExplanation 2.— “Illicit intercourse” has the same meaning as in section 98.\n"
  }
]